import main1 from "../../assets/gallery/menu/m/1.png";
import main2 from "../../assets/gallery/menu/m/2.png";
import main3 from "../../assets/gallery/menu/m/3.png";
import main4 from "../../assets/gallery/menu/m/4.png";
import main5 from "../../assets/gallery/menu/m/5.png";
import main6 from "../../assets/gallery/menu/m/6.png";

import des1 from "../../assets/gallery/menu/d/17.png";
import des2 from "../../assets/gallery/menu/d/16.png";
import des3 from "../../assets/gallery/menu/d/15.png";
import des4 from "../../assets/gallery/menu/d/14.png";
import des5 from "../../assets/gallery/menu/d/33.png";
import des6 from "../../assets/gallery/menu/d/14.png";

import salad1 from "../../assets/gallery/menu/s/1.png";
import salad2 from "../../assets/gallery/menu/s/2.png";
import salad3 from "../../assets/gallery/menu/s/3.png";
import salad4 from "../../assets/gallery/menu/s/4.png";
import salad5 from "../../assets/gallery/menu/s/5.png";
import salad6 from "../../assets/gallery/menu/s/6.png";


export const menuData = {
    mainCourse: [
        {
            "name": "Дорадо с овощами грилль",
            "price": "1500",
            "pic": main1,
            "details": "Очень вкусная рыба.",
            "kcal": "1050"

        },
        {
            "name": "Стейк из премиальной вырезки с брокколи и горчичным соусом",
            "price": "2350",
            "pic": main2,
            "details": "Подробное описание стейка",
            "kcal": "550"
        },
        {
            "name": "Тушёная козлятина на кости с картофельным пюре на сливках",
            "price": "2500",
            "pic": main3,
            "details": "Подробное описание тушёной козлятины",
            "kcal": "420"
        },
        {
            "name": "Итальянская классическая лазанья с говядиной в свежих томатах",
            "price": "1450",
            "pic": main4,
            "details": "Подробное описание итальянской классической лазаньи",
            "kcal": "380"
        },
        {
            "name": "Вок с рисом и курицей под соусом терияки",
            "price": "1000",
            "pic": main5,
            "details": "Подробное описание вока с рисом и курицей под соусом терияки",
            "kcal": "380"
        },
        {
            "name": "Хинкали с говядиной, калакури и аджарским соусом",
            "price": "1250",
            "pic": main6,
            "details": "Подробное описание хинкали с говядиной, калакури и аджарским соусом",
            "kcal": "380"
        }
    ],

    salad: [
        {
            "name": "Тыквенное наслаждение",
            "price": "500",
            "pic": salad1,
            "details": "Утонченный торт, гелато, эспрессо, пряные семечки и свежая земляника в гармонии в каждом кусочке.",
            "kcal": "450"
        },
        {
            "name": "Шоколадная симфония",
            "price": "350",
            "pic": salad2,
            "details": "Насладитесь роскошью шоколадного оливкового торта, смешанного с нежным лавандовым семифреддо, карамелизированным медом и взбитым кремом с оливковым маслом.",
            "kcal": "550"
        },
        {
            "name": "Тарт с кешью и карамелью",
            "price": "500",
            "pic": salad3,
            "details": "Роскошный тарт с кешью в карамельном масле, сопровождаемый свежестью цитрусового варенья, гелато с маслом из козьего молока и нежными маринованными кумкватами. В каждой порции - идеальное сочетание сладкого и освежающего.",
            "kcal": "420"
        },
        {
            "name": "Кокосовый крем-карамель с сливами и манго",
            "price": "450",
            "pic": salad4,
            "details": "Нежный кокосовый крем-карамель, дополненный сочными сливами и ароматным манго, завершается карамелизованным кокосовым хрустом. Это блюдо - путешествие в тропический рай, где каждый вкус - настоящее наслаждение.",
            "kcal": "380"
        },
        {
            "name": "Жареное мороженое с мусом из свежих ягод",
            "price": "400",
            "pic": salad5,
            "details": "Насладитесь уникальным десертом - жареным мороженым с мусом из свежих ягод, который мы создали для настоящих гурманов. Каждый кусочек хрустящей оболочки мороженого, сливается с ароматным мусом из отборных ягод, придают этому блюду невероятный вкусовой аккорд.",
            "kcal": "380"
        },
        {
            "name": "Медовая пахлава с грецкими орехами",
            "price": "550",
            "pic": salad6,
            "details": "Погрузитесь в восточные вкусы с нашей медовой пахлавой, усыпанной ароматными грецкими орехами. Каждый слой тонкого теста пропитан натуральным медом, а щедрая порция орехов добавляет этому десерту особый вкус и хрустящую текстуру.",
            "kcal": "380"
        }
    ],

    dessert: [
        {
            "name": "Индийские лепёшки с зелёным горошком в сливочном соусе",
            "price": "750",
            "pic": des1,
            "details": "Детали про индийские лепёшки",
            "kcal": "450"
        },
        {
            "name": "Жгучие грилль-перцы",
            "price": "850",
            "pic": des2,
            "details": "Детали про жгучие грилль-перцы",
            "kcal": "550"
        },
        {
            "name": "Греческий салат",
            "price": "550",
            "pic": des3,
            "details": "Детали про греческий салат",
            "kcal": "420"
        },
        {
            "name": "Брускетта с томатами и оливковым маслом",
            "price": "450",
            "pic": des4,
            "details": "Детали про брускетту с томатами и оливковым маслом",
            "kcal": "380"
        },
        {
            "name": "Морской коктейль",
            "price": "850",
            "pic": des5,
            "details": "Детали про морской коктейль",
            "kcal": "380"
        },
        {
            "name": "Сырные палочки из моцареллы с клюквенным соусом",
            "price": "850",
            "pic": des6,
            "details": "Детали про сырные палочки из моцареллы с клюквенным соусом",
            "kcal": "380"
        }
    ]
};
